from pymongo import MongoClient

# Подключение к MongoDB
client = MongoClient('localhost', 27017)

# Выбор базы данных
db = client['Basa']

# Создание коллекции "Массивы"
collection = db['Массивы']

# Вставка данных в коллекцию
data = [
    {"номер": "1", "Цвет": ["красный", "белый", "желтый"], "Вектор": [1, 2, 3, 4, 5]},
    {"номер": "2", "Цвет": ["красный", "зеленый", "желтый"], "Вектор": [5, 2, 3, 4, 0]},
    {"номер": "3", "Цвет": ["синий", "белый", "красный"], "Вектор": [1, 2, 0, 4, 1]},
    {"номер": "3", "Цвет": ["розовый", "синий", "красный"], "Вектор": [3, 5, 3, 4, 1]},
    {"номер": "3", "Цвет": ["зеленый", "синий", "красный"], "Вектор": [3, 5, 3, 5, 2]}
]

collection.insert_many(data)

# Вывод данных после вставки
for document in collection.find():
    print(document)

# Закрытие соединения с базой данных
client.close()
